%用于产生各种待测试的图像
X=(0:1:255)'*ones(1,256);
Y=X';

%二维正弦波
f11=sin(X);
f12=sin(Y);
f13=sin(X+5*Y);
f14=sin(X+5*Y+1);

%矩形图像
F=zeros(256,256);
f21=F;
f21(116:179,39:152)=1;

%矩形的两个顶点的坐标为（30,30）（142,70），对边经过点（10,80），注意这里的坐标从0开始
%用线性规划的方法可以在解出矩形边所在直线方程的前提下用不等式描述区域
f22=F;
f22(logical(double((40*X-112*Y+2160<=0)).*double((40*X-112*Y+9360>=0)).*double((112*X+40*Y-4560>=0)).*double((112*X+40*Y-18704<=0))))=1;

%原理同f22,两个顶点分别是（140,50）（192,77），对边经过（0,60）
f23=F;
f23(logical(double((27*X-52*Y-1180<=0)).*double((27*X-52*Y+3160>=0)).*double((52*X+27*Y-8630>=0)).*double((52*X+27*Y-12063<=0))))=1;

%二维高斯函数
mu=[0,0];
sigma1=[100,100];
sigma2=[150,150];
sigma3=[207,207];

f31=1/(2*pi*sigma1(1)*sigma1(2))*exp(-1/2*((X/sigma1(1)).^2+(Y/sigma1(2)).^2));
f31=f31/max(max(f31));

f32=1/(2*pi*sigma2(1)*sigma2(2))*exp(-1/2*((X/sigma2(1)).^2+(Y/sigma2(2)).^2));
f32=f32/max(max(f32));

f33=1/(2*pi*sigma3(1)*sigma3(2))*exp(-1/2*((X/sigma3(1)).^2+(Y/sigma3(2)).^2));
f33=f33/max(max(f33));
